In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

dataset = pd.read_csv('Data.csv');

In [2]:
X = dataset.iloc[:,:-1].values
Y = dataset.iloc[:,3].values

In [3]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [5]:
Y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [6]:
from sklearn.impute import SimpleImputer

In [7]:
imputer = SimpleImputer(missing_values = np.nan , strategy = "mean")
imputer.fit(X[:, 1:3])
X[:, 1:3] = imputer.transform(X[:, 1:3])

In [8]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [10]:
from sklearn.preprocessing import LabelEncoder , OneHotEncoder

In [11]:
labelencoder_X = LabelEncoder()
labelencoder_Y = LabelEncoder()

In [12]:
#X[: , 0] = labelencoder_X.fit_transform(X[: , 0])
onehotencoder = OneHotEncoder()

In [13]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [14]:
spare=onehotencoder.fit_transform(dataset.Country.values.reshape(-1,1)).toarray()

In [15]:
dataset.Country.values.reshape(-1,1)

array([['France'],
       ['Spain'],
       ['Germany'],
       ['Spain'],
       ['Germany'],
       ['France'],
       ['Spain'],
       ['France'],
       ['Germany'],
       ['France']], dtype=object)

In [16]:
spare

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [17]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [18]:
columns = ["Country_"+str(int(i)) for i in range(dataset.shape[1]-1)]

In [19]:
columns

['Country_0', 'Country_1', 'Country_2']

In [20]:
dfOneHot = pd.DataFrame()

In [21]:
dfOneHot= pd.DataFrame(spare,columns=columns)

In [22]:
dfOneHot

   Country_0  Country_1  Country_2
0        1.0        0.0        0.0
1        0.0        0.0        1.0
2        0.0        1.0        0.0
3        0.0        0.0        1.0
4        0.0        1.0        0.0
5        1.0        0.0        0.0
6        0.0        0.0        1.0
7        1.0        0.0        0.0
8        0.0        1.0        0.0
9        1.0        0.0        0.0

In [23]:
df = pd.concat([dataset, dfOneHot], axis=1)

In [24]:
df

   Country   Age   Salary Purchased  Country_0  Country_1  Country_2
0   France  44.0  72000.0        No        1.0        0.0        0.0
1    Spain  27.0  48000.0       Yes        0.0        0.0        1.0
2  Germany  30.0  54000.0        No        0.0        1.0        0.0
3    Spain  38.0  61000.0        No        0.0        0.0        1.0
4  Germany  40.0      NaN       Yes        0.0        1.0        0.0
5   France  35.0  58000.0       Yes        1.0        0.0        0.0
6    Spain   NaN  52000.0        No        0.0        0.0        1.0
7   France  48.0  79000.0       Yes        1.0        0.0        0.0
8  Germany  50.0  83000.0        No        0.0        1.0        0.0
9   France  37.0  67000.0       Yes        1.0        0.0        0.0

In [25]:
df= df.drop(['Country'], axis=1)
# to drop the Country column 
df

    Age   Salary Purchased  Country_0  Country_1  Country_2
0  44.0  72000.0        No        1.0        0.0        0.0
1  27.0  48000.0       Yes        0.0        0.0        1.0
2  30.0  54000.0        No        0.0        1.0        0.0
3  38.0  61000.0        No        0.0        0.0        1.0
4  40.0      NaN       Yes        0.0        1.0        0.0
5  35.0  58000.0       Yes        1.0        0.0        0.0
6   NaN  52000.0        No        0.0        0.0        1.0
7  48.0  79000.0       Yes        1.0        0.0        0.0
8  50.0  83000.0        No        0.0        1.0        0.0
9  37.0  67000.0       Yes        1.0        0.0        0.0